#include "main_headfile.h" //  Çì´õÆÄÀÏ ¼±¾ð¹® Çì´õ ÆÄÀÏ
#include "main_function.h" //  ÇÔ¼ö ¼±¾ð¹® Çì´õ ÆÄÀÏ

//¸ÞÀÎÈ­¸éÀ» Ãâ·ÂÃ³¸®¸¦ ´ã´çÇÏ°í ÀÖ´Â ÇÔ¼ö¸¦ ´ãÀº ÆÄÀÏÀÔ´Ï´Ù.
// ÀÏºÎ À©µµ¿ì¿Í È£È¯ÀÌ ¾ÈµÇ´Â ºÎºÐÀÌ Æ÷ÇÔµÇ¾î ÀÖ¾î¼­ ¹öÀüÀ» 2°³·Î ³ª´©¾ú½À´Ï´Ù.
// ÀÌ ¹öÀüÀº È£È¯À» À§ÇÑ ¹öÀüÀÌ¸ç v2ÀÔ´Ï´Ù.
void main_print(int case_print) {

	/* // main templates of this function
	printf("     ¦®¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦³¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦³¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¯\n");
	printf("     ¦­                        ¦­                         ¦­    ÀÚÁÖ »ç¿ëÇÏ´Â ±ä ±Û   ¦­\n");
	printf("     ¦­ ÀÚÁÖ »ç¿ëÇÏ´Â ³¹¸» ¿¬½À¦­      ÀÚÁÖ ¾²´Â ¹®±¸     ¦­     ¶Ç´Â  À¯¸íÇÑ ¹®ÇÐ    ¦­\n");
	printf("     ¦­                        ¦­                         ¦­                          ¦­\n");
	printf("     ¦²¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦µ¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦µ¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦´\n");
	printf("     ¦­                                                                             ¦­\n");
	printf("     ¦­                                                                             ¦­\n");
	printf("     ¦­                                                                             ¦­\n");
	printf("     ¦²¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¯                                                       ¦­\n");
	printf("     ¦­                        ¦­                                                       ¦­\n");
	printf("     ¦­	 ÇöÁ¦ ¼±ÅÃÇÏ½Å ¸Þ´º    ¦­                                                       ¦­\n");
	printf("     ¦­                        ¦­                                                       ¦­\n");
	printf("     ¦­                        ¦­                                                       ¦­\n");
	printf("     ¦­   ~~~~~~~~~~~~~~~~     ¦­                                                       ¦­\n");
	printf("     ¦­                        ¦­                                                       ¦­\n");
	printf("     ¦­                        ¦­                                                       ¦­\n");
	printf("     ¦­                        ¦­                                                       ¦­\n");
	printf("     ¦­                        ¦­                                                       ¦­\n");
	printf("     ¦­                        ¦­                                                       ¦­\n");
	printf("     ¦­                        ¦­                                                       ¦­\n");
	printf("     ¦­                        ¦­                                                       ¦­\n");
	printf("     ¦­                        ¦­                                                       ¦­\n");
	printf("     ¦­                        ¦­                                                       ¦­\n");
	printf("     ¦­                        ¦­                                                       ¦­\n");
	printf("     ¦­                        ¦­                                                       ¦­\n");
	printf("     ¦²¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦°                                                        ¦­\n");
	printf("     ¦­                                                                             ¦­\n");
	printf("     ¦­                                                                             ¦­\n");
	printf("     ¦­                                                                             ¦­\n");
	printf("     ¦±¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦°\n");
	*/

	/*

*/
	system("cls");
	switch (case_print) { // °¢°¢ »óÈ²¿¡ ¸Â°Ô
		case 1: // ³¹¸» ¿¬½ÀÀ» °¡¸£Å³ ¶§
			printf("     ¦®¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦³¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦³¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¯\n");
			printf("     ¦­                        ¦­                        ¦­                          ¦­\n");
			printf("     ¦­ ÀÚÁÖ »ç¿ëÇÏ´Â ³¹¸» ¿¬½À¦­      ÀÚÁÖ ¾²´Â ¹®±¸    ¦­     ÀÌ ÇÁ·Î±×·¥ÀÇ ¼³¸í   ¦­\n");
			printf("     ¦­                        ¦­                        ¦­                          ¦­\n");
			printf("     ¦²¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦µ¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦µ¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦´\n");
			printf("     ¦­ ¡è¡è¡è¡è¡è¡è¡è¡è¡è¡è¡è                                                       ¦­\n");
			printf("     ¦­                                                                              ¦­\n");
			printf("     ¦­                                                                              ¦­\n");
			printf("     ¦²¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¯                                                    ¦­\n");
			printf("     ¦­                        ¦­                                                    ¦­\n");
			printf("     ¦­	 ÇöÁ¦ ¼±ÅÃÇÏ½Å ¸Þ´º´Â  ¦­                                                    ¦­\n");
			printf("     ¦­                        ¦­                                                    ¦­\n");
			printf("     ¦­                        ¦­                                                    ¦­\n");
			printf("     ¦­ ÀÚÁÖ »ç¿ëÇÏ´Â ³¹¸» ¿¬½À¦­                                                    ¦­\n");
			printf("     ¦­                        ¦­                                                    ¦­\n");
			printf("     ¦­         ÀÔ´Ï´Ù.        ¦­                                                    ¦­\n");
			printf("     ¦­                        ¦­                                                    ¦­\n");
			printf("     ¦²¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦´                                                    ¦­\n");
			printf("     ¦­        ¸Þ´º¼³¸í        ¦­                                                    ¦­\n");
			printf("     ¦² ¦¬  ¦¬  ¦¬  ¦¬  ¦¬  ¦¬ ¦´                                                    ¦­\n");
			printf("     ¦­                        ¦­                                                    ¦­\n");
			printf("     ¦­¿©·¯ºÐµéÀÌ ÀÚÁÖ »ç¿ëÇÏ´Â¦­                                                    ¦­\n");
			printf("     ¦­  ³¹¸»À» ¿¬½ÀÇÒ¼ö ÀÖ´Â  ¦­                                                    ¦­\n");
			printf("     ¦­       ¸Þ´ºÀÔ´Ï´Ù.      ¦­                                                    ¦­\n");
			printf("     ¦­                        ¦­                                                    ¦­\n");
			printf("     ¦²¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦°                                                    ¦­\n");
			printf("     ¦­                                                                              ¦­\n");
			printf("     ¦­                    ¸Þ´º¸¦ ¼±ÅÃÇÏ½Ã·Á¸Õ enter Å°¸¦ ´©¸£½Ê½Ã¿À.                ¦­\n");
			printf("     ¦­                                                                              ¦­\n");
			printf("     ¦±¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦°\n");
			break;

		case 2: // ÀÚÁÖ ¾²´Â ¹®±¸¸¦ °¡¸£Å³¶§
			printf("     ¦®¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦³¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦³¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¯\n");
			printf("     ¦­                        ¦­                        ¦­                          ¦­\n");
			printf("     ¦­ ÀÚÁÖ »ç¿ëÇÏ´Â ³¹¸» ¿¬½À¦­      ÀÚÁÖ ¾²´Â ¹®±¸    ¦­     ÀÌ ÇÁ·Î±×·¥ÀÇ ¼³¸í   ¦­\n");
			printf("     ¦­                        ¦­                        ¦­                          ¦­\n");
			printf("     ¦²¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦µ¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦µ¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦´\n");
			printf("     ¦­                           ¡è¡è¡è¡è¡è¡è¡è¡è¡è¡è¡è                             ¦­\n");
			printf("     ¦­                                                                              ¦­\n");
			printf("     ¦­                                                                              ¦­\n");
			printf("     ¦²¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¯                                                    ¦­\n");
			printf("     ¦­                        ¦­                                                    ¦­\n");
			printf("     ¦­	 ÇöÁ¦ ¼±ÅÃÇÏ½Å ¸Þ´º´Â  ¦­                                                    ¦­\n");
			printf("     ¦­                        ¦­                                                    ¦­\n");
			printf("     ¦­                        ¦­                                                    ¦­\n");
			printf("     ¦­     ÀÚÁÖ ¾²´Â ¹®±¸     ¦­                                                    ¦­\n");
			printf("     ¦­                        ¦­                                                    ¦­\n");
			printf("     ¦­         ÀÔ´Ï´Ù.        ¦­                                                    ¦­\n");
			printf("     ¦­                        ¦­                                                    ¦­\n");
			printf("     ¦²¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦´                                                    ¦­\n");
			printf("     ¦­        ¸Þ´º¼³¸í        ¦­                                                    ¦­\n");
			printf("     ¦² ¦¬  ¦¬  ¦¬  ¦¬  ¦¬  ¦¬ ¦´                                                    ¦­\n");
			printf("     ¦­                        ¦­                                                    ¦­\n");
			printf("     ¦­¿©·¯ºÐµéÀÌ ÀÚÁÖ »ç¿ëÇÏ´Â¦­                                                    ¦­\n");
			printf("     ¦­  ¹®±¸¸¦ ¿¬½ÀÇÒ¼ö ÀÖ´Â  ¦­                                                    ¦­\n");
			printf("     ¦­       ¸Þ´ºÀÔ´Ï´Ù.      ¦­                                                    ¦­\n");
			printf("     ¦­                        ¦­                                                    ¦­\n");
			printf("     ¦²¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦°                                                    ¦­\n");
			printf("     ¦­                                                                              ¦­\n");
			printf("     ¦­                    ¸Þ´º¸¦ ¼±ÅÃÇÏ½Ã·Á¸Õ enter Å°¸¦ ´©¸£½Ê½Ã¿À.                ¦­\n");
			printf("     ¦­                                                                              ¦­\n");
			printf("     ¦±¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦°\n");
			break;

		case 3: // ÀÌ ÇÁ·Î±×·¥ÀÇ ¼³¸íÀ» °¡¸£Å³ ¶§
			printf("     ¦®¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦³¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦³¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¯\n");
			printf("     ¦­                        ¦­                        ¦­                          ¦­\n");
			printf("     ¦­ ÀÚÁÖ »ç¿ëÇÏ´Â ³¹¸» ¿¬½À¦­      ÀÚÁÖ ¾²´Â ¹®±¸    ¦­     ÀÌ ÇÁ·Î±×·¥ÀÇ ¼³¸í   ¦­\n");
			printf("     ¦­                        ¦­                        ¦­                          ¦­\n");
			printf("     ¦²¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦µ¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦µ¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦´\n");
			printf("     ¦­                                                      ¡è¡è¡è¡è¡è¡è¡è¡è¡è¡è¡è  ¦­\n");
			printf("     ¦­                                                                              ¦­\n");
			printf("     ¦­                                                                              ¦­\n");
			printf("     ¦²¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¯                                                    ¦­\n");
			printf("     ¦­                        ¦­                                                    ¦­\n");
			printf("     ¦­	 ÇöÁ¦ ¼±ÅÃÇÏ½Å ¸Þ´º´Â  ¦­                                                    ¦­\n");
			printf("     ¦­                        ¦­                                                    ¦­\n");
			printf("     ¦­                        ¦­                                                    ¦­\n");
			printf("     ¦­    ÀÌ ÇÁ·Î±×·¥ÀÇ ¼³¸í  ¦­                                                    ¦­\n");
			printf("     ¦­                        ¦­                                                    ¦­\n");
			printf("     ¦­         ÀÔ´Ï´Ù.        ¦­                                                    ¦­\n");
			printf("     ¦­                        ¦­                                                    ¦­\n");
			printf("     ¦²¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦´                                                    ¦­\n");
			printf("     ¦­        ¸Þ´º¼³¸í        ¦­                                                    ¦­\n");
			printf("     ¦² ¦¬  ¦¬  ¦¬  ¦¬  ¦¬  ¦¬ ¦´                                                    ¦­\n");
			printf("     ¦­                        ¦­                                                    ¦­\n");
			printf("     ¦­ ÀÌ ÇÁ·Î±×·¥ÀÇ °³¹ßÀÚ¿Í ¦­                                                    ¦­\n");
			printf("     ¦­ ÀÌ ÇÁ·Î±×·¥À» ¼³¸íÇÏ´Â ¦­                                                    ¦­\n");
			printf("     ¦­       ¸Þ´ºÀÔ´Ï´Ù.      ¦­                                                    ¦­\n");
			printf("     ¦­                        ¦­                                                    ¦­\n");
			printf("     ¦²¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦°                                                    ¦­\n");
			printf("     ¦­                                                                              ¦­\n");
			printf("     ¦­                    ¸Þ´º¸¦ ¼±ÅÃÇÏ½Ã·Á¸Õ enter Å°¸¦ ´©¸£½Ê½Ã¿À.                ¦­\n");
			printf("     ¦­                                                                              ¦­\n");
			printf("     ¦±¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦¬¦°\n");
			break;
	}

}
