#include "main_header.h"

void main_print(int case_print) {

	/* // main templates of this function
	printf("     旨收收收收收收收收收收收收收收收收收收收收收收收收有收收收收收收收收收收收收收收收收收收收收收收收收收有收收收收收收收收收收收收收收收收收收收收收收收收收收旬\n");
	printf("     早                        早                         早    濠輿 餌辨ж朝 曹 旋   早\n");
	printf("     早 濠輿 餌辨ж朝 章蜓 翱蝗早      濠輿 噙朝 僥掘     早     傳朝  嶸貲и 僥з    早\n");
	printf("     早                        早                         早                          早\n");
	printf("     曳收收收收收收收收收收收收收收收收收收收收收收收收朴收收收收收收收收收收收收收收收收收收收收收收收收收朴收收收收收收收收收收收收收收收收收收收收收收收收收收朽\n");
	printf("     早                                                                             早\n");
	printf("     早                                                                             早\n");
	printf("     早                                                                             早\n");
	printf("     曳收收收收收收收收收收收收收收收收收收收收收旬                                                       早\n");
	printf("     早                        早                                                       早\n");
	printf("     早	 ⑷薯 摹鷗и 詭景      早                                                       早\n");
	printf("     早                        早                                                       早\n");
	printf("     早                        早                                                       早\n");
	printf("     早   ~~~~~~~~~~~~~~~~     早                                                       早\n");
	printf("     早                        早                                                       早\n");
	printf("     早                        早                                                       早\n");
	printf("     早                        早                                                       早\n");
	printf("     早                        早                                                       早\n");
	printf("     早                        早                                                       早\n");
	printf("     早                        早                                                       早\n");
	printf("     早                        早                                                       早\n");
	printf("     早                        早                                                       早\n");
	printf("     早                        早                                                       早\n");
	printf("     早                        早                                                       早\n");
	printf("     早                        早                                                       早\n");
	printf("     曳收收收收收收收收收收收收收收收收收收收收收旭                                                        早\n");
	printf("     早                                                                             早\n");
	printf("     早                                                                             早\n");
	printf("     早                                                                             早\n");
	printf("     曲收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收旭\n");
	*/
	switch (case_print) {
	case 1:
		system("cls");
		printf("     旨收收收收收收收收收收收收收收收收收收收收收收收收有收收收收收收收收收收收收收收收收收收收收收收收收收有收收收收收收收收收收收收收收收收收收收收收收收收收收旬\n");
		printf("     早                        早                         早    濠輿 餌辨ж朝 曹 旋   早\n");
		printf("     早 濠輿 餌辨ж朝 章蜓 翱蝗早      濠輿 噙朝 僥掘     早     傳朝  嶸貲и 僥з    早\n");
		printf("     早                        早                         早                          早\n");
		printf("     曳收收收收收收收收收收收收收收收收收收收收收收收收朴收收收收收收收收收收收收收收收收收收收收收收收收收朴收收收收收收收收收收收收收收收收收收收收收收收收收收朽\n");
		printf("     早 ∟∟∟∟∟∟∟∟∟∟∟                                                      早\n");
		printf("     早                                                                             早\n");
		printf("     早                                                                             早\n");
		printf("     曳收收收收收收收收收收收收收收收收收收收收收收收收旬                                                    早\n");
		printf("     早                        早                                                    早\n");
		printf("     早	 ⑷薯 摹鷗и 詭景朝   早                                                    早\n");
		printf("     早                        早                                                    早\n");
		printf("     早                        早                                                    早\n");
		printf("     早 濠輿 餌辨ж朝 章蜓 翱蝗早                                                    早\n");
		printf("     早                        早                                                    早\n");
		printf("     早         殮棲棻.        早                                                    早\n");
		printf("     早                        早                                                    早\n");
		printf("     曳收收收收收收收收收收收收收收收收收收收收收收收收朽                                                    早\n");
		printf("     早        詭景撲貲        早                                                    早\n");
		printf("     曳 收  收  收  收  收  收  收  收 朽                                                    早\n");
		printf("     早                        早                                                    早\n");
		printf("     早罹楝碟菟檜 濠輿 餌辨ж朝早                                                    早\n");
		printf("     早  章蜓擊 翱蝗й熱 氈朝  早                                                    早\n");
		printf("     早       詭景殮棲棻.      早                                                    早\n");
		printf("     早                        早                                                    早\n");
		printf("     曳收收收收收收收收收收收收收收收收收收收收收收收收旭                                                    早\n");
		printf("     早                                                                             早\n");
		printf("     早                                                                             早\n");
		printf("     早                                                                             早\n");
		printf("     曲收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收旭\n");
		break;

	case 2:
		printf("     旨收收收收收收收收收收收收收收收收收收收收收收收收有收收收收收收收收收收收收收收收收收收收收收收收收收有收收收收收收收收收收收收收收收收收收收收收收收收收收旬\n");
		printf("     早                        早                         早    濠輿 餌辨ж朝 曹 旋   早\n");
		printf("     早 濠輿 餌辨ж朝 章蜓 翱蝗早      濠輿 噙朝 僥掘     早     傳朝  嶸貲и 僥з    早\n");
		printf("     早                        早                         早                          早\n");
		printf("     曳收收收收收收收收收收收收收收收收收收收收收收收收朴收收收收收收收收收收收收收收收收收收收收收收收收收朴收收收收收收收收收收收收收收收收收收收收收收收收收收朽\n");
		printf("     早                           ∟∟∟∟∟∟∟∟∟∟∟                            早\n");
		printf("     早                                                                             早\n");
		printf("     早                                                                             早\n");
		printf("     曳收收收收收收收收收收收收收收收收收收收收收收收收旬                                                    早\n");
		printf("     早                        早                                                    早\n");
		printf("     早	 ⑷薯 摹鷗и 詭景朝   早                                                    早\n");
		printf("     早                        早                                                    早\n");
		printf("     早                        早                                                    早\n");
		printf("     早     濠輿 噙朝 僥掘     早                                                    早\n");
		printf("     早                        早                                                    早\n");
		printf("     早         殮棲棻.        早                                                    早\n");
		printf("     早                        早                                                    早\n");
		printf("     曳收收收收收收收收收收收收收收收收收收收收收收收收朽                                                    早\n");
		printf("     早        詭景撲貲        早                                                    早\n");
		printf("     曳 收  收  收  收  收  收  收  收 朽                                                    早\n");
		printf("     早                        早                                                    早\n");
		printf("     早罹楝碟菟檜 濠輿 餌辨ж朝早                                                    早\n");
		printf("     早  僥掘蒂 翱蝗й熱 氈朝  早                                                    早\n");
		printf("     早       詭景殮棲棻.      早                                                    早\n");
		printf("     早                        早                                                    早\n");
		printf("     曳收收收收收收收收收收收收收收收收收收收收收收收收旭                                                    早\n");
		printf("     早                                                                             早\n");
		printf("     早                                                                             早\n");
		printf("     早                                                                             早\n");
		printf("     曲收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收旭\n");
		break;

	case 3:
		printf("     旨收收收收收收收收收收收收收收收收收收收收收收收收有收收收收收收收收收收收收收收收收收收收收收收收收收有收收收收收收收收收收收收收收收收收收收收收收收收收收旬\n");
		printf("     早                        早                         早    濠輿 餌辨ж朝 曹 旋   早\n");
		printf("     早 濠輿 餌辨ж朝 章蜓 翱蝗早      濠輿 噙朝 僥掘     早     傳朝  嶸貲и 僥з    早\n");
		printf("     早                        早                         早                          早\n");
		printf("     曳收收收收收收收收收收收收收收收收收收收收收收收收朴收收收收收收收收收收收收收收收收收收收收收收收收收朴收收收收收收收收收收收收收收收收收收收收收收收收收收朽\n");
		printf("     早                                                      ∟∟∟∟∟∟∟∟∟∟∟ 早\n");
		printf("     早                                                                             早\n");
		printf("     早                                                                             早\n");
		printf("     曳收收收收收收收收收收收收收收收收收收收收收收收收旬                                                    早\n");
		printf("     早                        早                                                    早\n");
		printf("     早	 ⑷薯 摹鷗и 詭景朝   早                                                    早\n");
		printf("     早                        早                                                    早\n");
		printf("     早   濠輿 餌辨ж朝 曹 旋  早                                                    早\n");
		printf("     早       嶸貲и 僥з      早                                                    早\n");
		printf("     早                        早                                                    早\n");
		printf("     早         殮棲棻.        早                                                    早\n");
		printf("     早                        早                                                    早\n");
		printf("     曳收收收收收收收收收收收收收收收收收收收收收收收收朽                                                    早\n");
		printf("     早        詭景撲貲        早                                                    早\n");
		printf("     曳 收  收  收  收  收  收  收  收 朽                                                    早\n");
		printf("     早                        早                                                    早\n");
		printf("     早罹楝碟菟檜 濠輿 餌辨ж朝早                                                    早\n");
		printf("     早  曹 旋擊 翱蝗й熱 氈朝 早                                                    早\n");
		printf("     早       詭景殮棲棻.      早                                                    早\n");
		printf("     早                        早                                                    早\n");
		printf("     曳收收收收收收收收收收收收收收收收收收收收收收收收旭                                                    早\n");
		printf("     早                                                                             早\n");
		printf("     早                                                                             早\n");
		printf("     早                                                                             早\n");
		printf("     曲收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收旭\n");
		break;
	}

}